app/controllers/application_controller.rb

    def authenticate
        auth_header = request.headers["Authorization"]
        token = auth_header.split.last
        payload = JWT.decode(token, 'my_secret', true, { algorithm: 'HS256'})[0]
        @current_user = User.find_by(id: payload["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]