app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments"
---
    def index
        appointments = Appointment.all

INSERT INTO "appointments" ("date", "start_time", "description", "user_id", "salon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        appointment = Appointment.create(appointment_params)

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        appointment = Appointment.find_by(id: params[:id])

SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = $1  [["user_id", 5]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 4]]
---
    def destroy
        appointment = Appointment.find_by(id: params[:user], id: params[:appointment])

        if appointment
            appointment.destroy