app/controllers/reviews_controller.rb

    def create

        review = Review.create(review_params)
---
INSERT INTO "reviews" ("rating", "comment", "salon_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 1], ["comment", "testing"], ["salon_id", 3], ["user_id", 4], ["created_at", "2021-08-19 20:09:56.175079"], ["updated_at", "2021-08-19 20:09:56.175079"]]

    def show
        review = Review.find_by(id: params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]