app/controllers/salons_controller.rb

SELECT "salons".* FROM "salons"
---
    def index
        salons = Salon.all

SELECT "salons".* FROM "salons" WHERE "salons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        salon = Salon.find_by(id: params[:id])