app/controllers/services_controller.rb

    def create
        service = Service.create(service_params)
---
INSERT INTO "services" ("name", "price", "salon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Deep Conditioning"], ["price", 40], ["salon_id", 2], ["created_at", "2021-08-11 03:29:22.064185"], ["updated_at", "2021-08-11 03:29:22.064185"]]