app/controllers/users_controller.rb

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("name", "user_name", "password_digest", "email", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def login
        user = User.find_by(user_name: params[:user][:user_name])
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "Maxxyyyy"], ["LIMIT", 1]]