app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "Shev"], ["LIMIT", 1]]
---
    def login
        user = User.find_by(user_name: params[:user][:user_name])