app/models/salon.rb

SELECT "services".* FROM "services" WHERE "services"."salon_id" = $1  [["salon_id", 2]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."salon_id" = $1  [["salon_id", 1]]
---
    def with_services_reviews
        {
            id: self.id,
            name: self.name,
            location: self.location,
            specialize_in: self.specialize_in,
            description: self.description,
            image: self.image,
            services: self.services.map do |service|
                {
                    name: service.name,
                    price: service.price,
                }
            end,
            reviews: self.reviews.map do |review|