app/models/user.rb

    def with_appointments
        {
            id: self.id,
            name: self.name,
            user_name: self.user_name,
            password_digest: self.password_digest,
            email: self.email,
            admin: self.admin,
            appointments: self.appointments.map do |appointment|
                {
                    date: appointment.date,
                    start_time: appointment.start_time,
                    end_time: appointment.end_time,
                    description: appointment.description
                }
            end,
            salon: self.salons.map do |salon|
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = $1  [["user_id", 2]]
SELECT "salons".* FROM "salons" INNER JOIN "appointments" ON "salons"."id" = "appointments"."salon_id" WHERE "appointments"."user_id" = $1  [["user_id", 1]]